benchmarks/cospec_benchmark_results_20250525_170246_facebook/opt-6.7b_facebook/opt-125m_tp1_dtp1/colocation_consolidated_7_-1_8_math500_output.txt
INFO 05-25 18:33:51 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='math500', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=8.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=-1.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 500 samples from cache from HuggingFaceH4/cache/math500_facebook/opt-6.7b.json
Split dataset into 50 test samples and 450 training samples
Temperature:  -1.0
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Don't need to train selective validator
Running full benchmark...
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 8.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     2248      
Benchmark duration (s):                  300.17    
Total input tokens:                      162044    
Total generated tokens:                  495534    
Request throughput (req/s):              7.49      
Output token throughput (tok/s):         1650.87   
Total Token throughput (tok/s):          2190.72   
---------------Time to First Token----------------
Mean TTFT (ms):                          359.02    
Median TTFT (ms):                        355.43    
P99 TTFT (ms):                           574.94    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.14     
Median TPOT (ms):                        35.47     
P99 TPOT (ms):                           77.71     
---------------Inter-token Latency----------------
Mean ITL (ms):                           150.66    
Median ITL (ms):                         151.61    
P99 ITL (ms):                            274.58    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          7899.98   
Median E2EL (ms):                        6339.79   
P99 E2EL (ms):                           28924.77  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 40.62     
Median Token Latency (ms):               37.85     
P99 Token Latency (ms):                  82.55     
==================================================